app/controllers/admin/establishments_controller.rb

  def index
    @establishments = Establishment.where(user_id: current_user.id)
---
SELECT "establishments".* FROM "establishments" WHERE "establishments"."user_id" = $1  [["user_id", 1]]