app/controllers/site/establishments_controller.rb

SELECT "establishments".* FROM "establishments"
---
  def index
    @establishments = Establishment.all

INSERT INTO "establishments" ("name", "address", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @establishment = Establishment.new(establishment_params)
    @establishment.user_id = current_user.id
    @establishment.status = 1

    respond_to do |format|
      if @establishment.save

DELETE FROM "establishments" WHERE "establishments"."id" = $1  [["id", 3]]
---
  def destroy
    @establishment.destroy

SELECT  "establishments".* FROM "establishments" WHERE "establishments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_establishment
      @establishment = Establishment.find(params[:id])