app/controllers/site/products_controller.rb

  def index
    @products = Product.where(establishment_id: params[:establishment_id])
---
SELECT  "products".* FROM "products" WHERE "products"."establishment_id" = $1 LIMIT $2  [["establishment_id", 4], ["LIMIT", 1]]

  def create
    @product = Product.new(product_params)
    @product.establishment_id = params[:establishment_id]

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "price", "establishment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Arroz"], ["description", "Arroz "], ["price", "12.90"], ["establishment_id", 1], ["created_at", 2016-10-07 18:36:19 UTC], ["updated_at", 2016-10-07 18:36:19 UTC]]