app/controllers/site/product_shopping_lists_controller.rb

SELECT "product_shopping_lists".* FROM "product_shopping_lists" WHERE "product_shopping_lists"."shopping_list_id" = $1  [["shopping_list_id", 12]]
---
  def index
    @product_shopping_lists = ProductShoppingList.where(shopping_list_id: params[:shopping_list_id])

SELECT  "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
    def set_product_shopping_list
      @product_shopping_list = ProductShoppingList.find(params[:id])