app/controllers/site/shopping_lists_controller.rb

SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."user_id" = $1  [["user_id", 1]]
---
  def index
    @shopping_lists = ShoppingList.where(user_id: current_user.id)

SELECT  "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def continue

    @shopping_list = ShoppingList.find(params[:id])

SELECT "product_shopping_lists".* FROM "product_shopping_lists" WHERE "product_shopping_lists"."shopping_list_id" = $1  [["shopping_list_id", 1]]
---
  def show
    @shopping_list = ProductShoppingList.where(shopping_list_id: params[:id])

INSERT INTO "product_shopping_lists" ("product_id", "shopping_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 1], ["shopping_list_id", 1], ["created_at", 2016-10-08 17:50:52 UTC], ["updated_at", 2016-10-08 17:50:52 UTC]]
INSERT INTO "shopping_lists" ("user_id", "establishment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["establishment_id", 1], ["created_at", 2016-10-08 17:50:52 UTC], ["updated_at", 2016-10-08 17:50:52 UTC]]
---
  def create

    if @shopping_list_item = ProductShoppingList.create(product_id: params[:product_id], shopping_list_id: session[:shopping_list_id])

DELETE FROM "product_shopping_lists" WHERE "product_shopping_lists"."id" = $1  [["id", 2]]
DELETE FROM "shopping_lists" WHERE "shopping_lists"."id" = $1  [["id", 6]]
---
  def destroy
    @shopping_list.destroy

SELECT  "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "product_shopping_lists".* FROM "product_shopping_lists" WHERE "product_shopping_lists"."shopping_list_id" = $1  [["shopping_list_id", 2]]
UPDATE "shopping_lists" SET "name" = $1, "updated_at" = $2 WHERE "shopping_lists"."id" = $3  [["name", "Listagem"], ["updated_at", 2016-10-08 20:36:20 UTC], ["id", 10]]
---
    def set_session_shopping_list

      @shopping_list = ShoppingList.find(session[:shopping_list_id])

      rescue
        @shopping_list = ShoppingList.create(establishment_id: params[:establishment_id],user_id: current_user.id)
        session[:shopping_list_id]=@shopping_list.id
        @shopping_list = ShoppingList.find(session[:shopping_list_id])
        @shopping_list.name="Lista #{ @shopping_list.id } do #{ @shopping_list.establishment.name }"
        @shopping_list.save